BsAtHome/atpack/Atmel.ATtiny_DFP.atpack/edc/ATtiny416.PIC
        <edc:AdjustPoint edc:_addr="0x186" edc:offset="0x4"/>
        <edc:SFRDef edc:_addr="0x18A" edc:access="nnnnnnnn" edc:cname="SYNCCH0" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
              <edc:SFRFieldDef edc:cname="SYNCCH0" edc:desc="Synchronous Channel 0 Generator Selection" edc:nzwidth="0x8">
                <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Off" edc:when="(field &amp; 0xFF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="TCB0" edc:desc="Timer/Counter B0" edc:when="(field &amp; 0xFF) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="TCA0_OVF_LUNF" edc:desc="Timer/Counter A0 overflow" edc:when="(field &amp; 0xFF) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="TCA0_HUNF" edc:desc="Timer/Counter A0 underflow high byte (split mode)" edc:when="(field &amp; 0xFF) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="TCA0_CMP0" edc:desc="Timer/Counter A0 compare 0" edc:when="(field &amp; 0xFF) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="TCA0_CMP1" edc:desc="Timer/Counter A0 compare 1" edc:when="(field &amp; 0xFF) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="TCA0_CMP2" edc:desc="Timer/Counter A0 compare 2" edc:when="(field &amp; 0xFF) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="PORTC_PIN0" edc:desc="Synchronous Event from Pin PC0" edc:when="(field &amp; 0xFF) == 0x07"/>
                <edc:SFRFieldSemantic edc:cname="PORTC_PIN1" edc:desc="Synchronous Event from Pin PC1" edc:when="(field &amp; 0xFF) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="PORTC_PIN2" edc:desc="Synchronous Event from Pin PC2" edc:when="(field &amp; 0xFF) == 0x09"/>
                <edc:SFRFieldSemantic edc:cname="PORTC_PIN3" edc:desc="Synchronous Event from Pin PC3" edc:when="(field &amp; 0xFF) == 0x0A"/>
                <edc:SFRFieldSemantic edc:cname="PORTC_PIN4" edc:desc="Synchronous Event from Pin PC4" edc:when="(field &amp; 0xFF) == 0x0B"/>
                <edc:SFRFieldSemantic edc:cname="PORTC_PIN5" edc:desc="Synchronous Event from Pin PC5" edc:when="(field &amp; 0xFF) == 0x0C"/>
                <edc:SFRFieldSemantic edc:cname="PORTA_PIN0" edc:desc="Synchronous Event from Pin PA0" edc:when="(field &amp; 0xFF) == 0x0D"/>
                <edc:SFRFieldSemantic edc:cname="PORTA_PIN1" edc:desc="Synchronous Event from Pin PA1" edc:when="(field &amp; 0xFF) == 0x0E"/>
                <edc:SFRFieldSemantic edc:cname="PORTA_PIN2" edc:desc="Synchronous Event from Pin PA2" edc:when="(field &amp; 0xFF) == 0x0F"/>
                <edc:SFRFieldSemantic edc:cname="PORTA_PIN3" edc:desc="Synchronous Event from Pin PA3" edc:when="(field &amp; 0xFF) == 0x10"/>
                <edc:SFRFieldSemantic edc:cname="PORTA_PIN4" edc:desc="Synchronous Event from Pin PA4" edc:when="(field &amp; 0xFF) == 0x11"/>
                <edc:SFRFieldSemantic edc:cname="PORTA_PIN5" edc:desc="Synchronous Event from Pin PA5" edc:when="(field &amp; 0xFF) == 0x12"/>
                <edc:SFRFieldSemantic edc:cname="PORTA_PIN6" edc:desc="Synchronous Event from Pin PA6" edc:when="(field &amp; 0xFF) == 0x13"/>
                <edc:SFRFieldSemantic edc:cname="PORTA_PIN7" edc:desc="Synchronous Event from Pin PA7" edc:when="(field &amp; 0xFF) == 0x14"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x18B" edc:access="nnnnnnnn" edc:cname="SYNCCH1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
              <edc:SFRFieldDef edc:cname="SYNCCH1" edc:desc="Synchronous Channel 1 Generator Selection" edc:nzwidth="0x8">
                <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Off" edc:when="(field &amp; 0xFF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="TCB0" edc:desc="Timer/Counter B0" edc:when="(field &amp; 0xFF) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="TCA0_OVF_LUNF" edc:desc="Timer/Counter A0 overflow" edc:when="(field &amp; 0xFF) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="TCA0_HUNF" edc:desc="Timer/Counter A0 underflow high byte (split mode)" edc:when="(field &amp; 0xFF) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="TCA0_CMP0" edc:desc="Timer/Counter A0 compare 0" edc:when="(field &amp; 0xFF) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="TCA0_CMP1" edc:desc="Timer/Counter A0 compare 1" edc:when="(field &amp; 0xFF) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="TCA0_CMP2" edc:desc="Timer/Counter A0 compare 2" edc:when="(field &amp; 0xFF) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="PORTB_PIN0" edc:desc="Synchronous Event from Pin PB0" edc:when="(field &amp; 0xFF) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="PORTB_PIN1" edc:desc="Synchronous Event from Pin PB1" edc:when="(field &amp; 0xFF) == 0x09"/>
                <edc:SFRFieldSemantic edc:cname="PORTB_PIN2" edc:desc="Synchronous Event from Pin PB2" edc:when="(field &amp; 0xFF) == 0x0A"/>
                <edc:SFRFieldSemantic edc:cname="PORTB_PIN3" edc:desc="Synchronous Event from Pin PB3" edc:when="(field &amp; 0xFF) == 0x0B"/>
                <edc:SFRFieldSemantic edc:cname="PORTB_PIN4" edc:desc="Synchronous Event from Pin PB4" edc:when="(field &amp; 0xFF) == 0x0C"/>
                <edc:SFRFieldSemantic edc:cname="PORTB_PIN5" edc:desc="Synchronous Event from Pin PB5" edc:when="(field &amp; 0xFF) == 0x0D"/>
                <edc:SFRFieldSemantic edc:cname="PORTB_PIN6" edc:desc="Synchronous Event from Pin PB6" edc:when="(field &amp; 0xFF) == 0x0E"/>
                <edc:SFRFieldSemantic edc:cname="PORTB_PIN7" edc:desc="Synchronous Event from Pin PB7" edc:when="(field &amp; 0xFF) == 0x0F"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x18C" edc:offset="0x6"/>
        <edc:SFRDef edc:_addr="0x192" edc:access="nnnnnnnn" edc:cname="ASYNCUSER0" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
              <edc:SFRFieldDef edc:cname="ASYNCUSER0" edc:desc="Asynchronous User Ch 0 Input Selection - TCB0" edc:nzwidth="0x8">
                <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Off" edc:when="(field &amp; 0xFF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="SYNCCH0" edc:desc="Synchronous Event Channel 0" edc:when="(field &amp; 0xFF) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="SYNCCH1" edc:desc="Synchronous Event Channel 1" edc:when="(field &amp; 0xFF) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="ASYNCCH0" edc:desc="Asynchronous Event Channel 0" edc:when="(field &amp; 0xFF) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="ASYNCCH1" edc:desc="Asynchronous Event Channel 1" edc:when="(field &amp; 0xFF) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="ASYNCCH2" edc:desc="Asynchronous Event Channel 2" edc:when="(field &amp; 0xFF) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="ASYNCCH3" edc:desc="Asynchronous Event Channel 3" edc:when="(field &amp; 0xFF) == 0x06"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
